# 梅花A,方块4,梅花2,方块4,红桃7,黑桃Q,红桃K,梅花9,方块9,红桃5,梅花J,方块8,红桃5,黑桃3,黑桃10,黑桃3,红桃7,黑桃Q
L=input("输入多张扑克牌值(花色+点数)以逗号分隔(黑桃3,红桃6)：").split(',')
pk={'方块':4,'梅花':3,'红桃':2,'黑桃':1}
sk={'A':14,'K':13,'Q':12,'J':11,'10':10,'9':9,'8':8,'7':7,'6':6,'5':5,'4':4,'3':3,'2':2,'1':1}
L.sort(key=lambda k:pk[k[0:2]])
print("---按花色从小到大排序---")
print(L)
L.sort(key=lambda k:(-pk[k[0:2]],sk[k[2:]]),reverse=True)
print("---按花色从小到大，再按点数从大到小排序---")
print(L)
print("---去除重复元素---")
dic={}
dic=dic.fromkeys(L)
L1=list(dic.keys())
print(L1)
